FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_pm.h
/**
 * \file
 *
 * \brief Component description for PM
 *
 * Copyright (c) 2013 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMD20_PM_COMPONENT_
#define _SAMD20_PM_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PM */
/* ========================================================================== */
/** \addtogroup SAMD20_PM Power Manager */
/*@{*/

#define REV_PM    0x200

/* -------- PM_CTRL : (PM Offset: 0x00) (R/W  8) Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t  : 2;        /*!< bit:  0.. 1  Reserved                           */
            uint8_t CFDEN : 1;   /*!< bit:      2  Clock Failure Detector Enable      */
            uint8_t  : 1;        /*!< bit:      3  Reserved                           */
            uint8_t BKUPCLK : 1; /*!< bit:      4  Backup Clock Select                */
            uint8_t  : 3;        /*!< bit:  5.. 7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } PM_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_CTRL_OFFSET         0x00              /**< \brief (PM_CTRL offset) Control Register */
#define PM_CTRL_RESETVALUE     0x00              /**< \brief (PM_CTRL reset_value) Control Register */

#define PM_CTRL_CFDEN_Pos      2                 /**< \brief (PM_CTRL) Clock Failure Detector Enable */
#define PM_CTRL_CFDEN          ( 0x1u << PM_CTRL_CFDEN_Pos )
#define PM_CTRL_BKUPCLK_Pos    4                 /**< \brief (PM_CTRL) Backup Clock Select */
#define PM_CTRL_BKUPCLK        ( 0x1u << PM_CTRL_BKUPCLK_Pos )
#define PM_CTRL_MASK           0x14u             /**< \brief (PM_CTRL) MASK Register */

/* -------- PM_SLEEP : (PM Offset: 0x01) (R/W  8) Sleep Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t IDLE : 2;  /*!< bit:  0.. 1  Idle Level                         */
            uint8_t  : 6;      /*!< bit:  2.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } PM_SLEEP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_SLEEP_OFFSET        0x01              /**< \brief (PM_SLEEP offset) Sleep Register */
#define PM_SLEEP_RESETVALUE    0x00              /**< \brief (PM_SLEEP reset_value) Sleep Register */

#define PM_SLEEP_IDLE_Pos      0                 /**< \brief (PM_SLEEP) Idle Level */
#define PM_SLEEP_IDLE_Msk      ( 0x3u << PM_SLEEP_IDLE_Pos )
#define PM_SLEEP_IDLE( value )    ( ( PM_SLEEP_IDLE_Msk & ( ( value ) << PM_SLEEP_IDLE_Pos ) ) )
#define PM_SLEEP_MASK          0x03u             /**< \brief (PM_SLEEP) MASK Register */

/* -------- PM_CPUSEL : (PM Offset: 0x08) (R/W  8) CPU Clock Select -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t CPUDIV : 3; /*!< bit:  0.. 2  CPU Clock Select                   */
            uint8_t  : 5;       /*!< bit:  3.. 7  Reserved                           */
        } bit;                  /*!< Structure used for bit  access                  */
        uint8_t reg;            /*!< Type      used for register access              */
    } PM_CPUSEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_CPUSEL_OFFSET        0x08             /**< \brief (PM_CPUSEL offset) CPU Clock Select */
#define PM_CPUSEL_RESETVALUE    0x00             /**< \brief (PM_CPUSEL reset_value) CPU Clock Select */

#define PM_CPUSEL_CPUDIV_Pos    0                /**< \brief (PM_CPUSEL) CPU Clock Select */
#define PM_CPUSEL_CPUDIV_Msk    ( 0x7u << PM_CPUSEL_CPUDIV_Pos )
#define PM_CPUSEL_CPUDIV( value )    ( ( PM_CPUSEL_CPUDIV_Msk & ( ( value ) << PM_CPUSEL_CPUDIV_Pos ) ) )
#define PM_CPUSEL_MASK          0x07u            /**< \brief (PM_CPUSEL) MASK Register */

/* -------- PM_APBASEL : (PM Offset: 0x09) (R/W  8) APBA Clock Select -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t APBADIV : 3; /*!< bit:  0.. 2  APBA Clock Select                  */
            uint8_t  : 5;        /*!< bit:  3.. 7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } PM_APBASEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_APBASEL_OFFSET         0x09           /**< \brief (PM_APBASEL offset) APBA Clock Select */
#define PM_APBASEL_RESETVALUE     0x00           /**< \brief (PM_APBASEL reset_value) APBA Clock Select */

#define PM_APBASEL_APBADIV_Pos    0              /**< \brief (PM_APBASEL) APBA Clock Select */
#define PM_APBASEL_APBADIV_Msk    ( 0x7u << PM_APBASEL_APBADIV_Pos )
#define PM_APBASEL_APBADIV( value )    ( ( PM_APBASEL_APBADIV_Msk & ( ( value ) << PM_APBASEL_APBADIV_Pos ) ) )
#define PM_APBASEL_MASK           0x07u          /**< \brief (PM_APBASEL) MASK Register */

/* -------- PM_APBBSEL : (PM Offset: 0x0A) (R/W  8) APBB Clock Select -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t APBBDIV : 3; /*!< bit:  0.. 2  PB Clock Select                    */
            uint8_t  : 5;        /*!< bit:  3.. 7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } PM_APBBSEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

