FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_pm.h
#define PM_APBBSEL_OFFSET         0x0A           /**< \brief (PM_APBBSEL offset) APBB Clock Select */
#define PM_APBBSEL_RESETVALUE     0x00           /**< \brief (PM_APBBSEL reset_value) APBB Clock Select */

#define PM_APBBSEL_APBBDIV_Pos    0              /**< \brief (PM_APBBSEL) PB Clock Select */
#define PM_APBBSEL_APBBDIV_Msk    ( 0x7u << PM_APBBSEL_APBBDIV_Pos )
#define PM_APBBSEL_APBBDIV( value )    ( ( PM_APBBSEL_APBBDIV_Msk & ( ( value ) << PM_APBBSEL_APBBDIV_Pos ) ) )
#define PM_APBBSEL_MASK           0x07u          /**< \brief (PM_APBBSEL) MASK Register */

/* -------- PM_APBCSEL : (PM Offset: 0x0B) (R/W  8) APBC Clock Select -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t APBCDIV : 3; /*!< bit:  0.. 2  APBC Clock Select                  */
            uint8_t  : 5;        /*!< bit:  3.. 7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } PM_APBCSEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_APBCSEL_OFFSET         0x0B           /**< \brief (PM_APBCSEL offset) APBC Clock Select */
#define PM_APBCSEL_RESETVALUE     0x00           /**< \brief (PM_APBCSEL reset_value) APBC Clock Select */

#define PM_APBCSEL_APBCDIV_Pos    0              /**< \brief (PM_APBCSEL) APBC Clock Select */
#define PM_APBCSEL_APBCDIV_Msk    ( 0x7u << PM_APBCSEL_APBCDIV_Pos )
#define PM_APBCSEL_APBCDIV( value )    ( ( PM_APBCSEL_APBCDIV_Msk & ( ( value ) << PM_APBCSEL_APBCDIV_Pos ) ) )
#define PM_APBCSEL_MASK           0x07u          /**< \brief (PM_APBCSEL) MASK Register */

/* -------- PM_AHBMASK : (PM Offset: 0x14) (R/W 32) AHB Mask -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t HPB0 : 1;    /*!< bit:      0  HPB0 AHB Clock Mask                */
            uint32_t HPB1 : 1;    /*!< bit:      1  HPB1 AHB Clock Mask                */
            uint32_t HPB2 : 1;    /*!< bit:      2  HPB2 AHB Clock Mask                */
            uint32_t DSU : 1;     /*!< bit:      3  DSU AHB Clock Mask                 */
            uint32_t NVMCTRL : 1; /*!< bit:      4  NVMCTRL AHB Clock Mask             */
            uint32_t : 27;        /*!< bit:  5..31  Reserved                           */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } PM_AHBMASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_AHBMASK_OFFSET         0x14           /**< \brief (PM_AHBMASK offset) AHB Mask */
#define PM_AHBMASK_RESETVALUE     0x0000001F     /**< \brief (PM_AHBMASK reset_value) AHB Mask */

#define PM_AHBMASK_HPB0_Pos       0              /**< \brief (PM_AHBMASK) HPB0 AHB Clock Mask */
#define PM_AHBMASK_HPB0           ( 0x1u << PM_AHBMASK_HPB0_Pos )
#define PM_AHBMASK_HPB1_Pos       1              /**< \brief (PM_AHBMASK) HPB1 AHB Clock Mask */
#define PM_AHBMASK_HPB1           ( 0x1u << PM_AHBMASK_HPB1_Pos )
#define PM_AHBMASK_HPB2_Pos       2              /**< \brief (PM_AHBMASK) HPB2 AHB Clock Mask */
#define PM_AHBMASK_HPB2           ( 0x1u << PM_AHBMASK_HPB2_Pos )
#define PM_AHBMASK_DSU_Pos        3              /**< \brief (PM_AHBMASK) DSU AHB Clock Mask */
#define PM_AHBMASK_DSU            ( 0x1u << PM_AHBMASK_DSU_Pos )
#define PM_AHBMASK_NVMCTRL_Pos    4              /**< \brief (PM_AHBMASK) NVMCTRL AHB Clock Mask */
#define PM_AHBMASK_NVMCTRL        ( 0x1u << PM_AHBMASK_NVMCTRL_Pos )
#define PM_AHBMASK_MASK           0x0000001Fu    /**< \brief (PM_AHBMASK) MASK Register */

/* -------- PM_APBAMASK : (PM Offset: 0x18) (R/W 32) APBA Mask -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t PAC0 : 1;    /*!< bit:      0  PAC0 APB Clock Mask                */
            uint32_t PM : 1;      /*!< bit:      1  PM APB Clock Mask                  */
            uint32_t SYSCTRL : 1; /*!< bit:      2  SYSCTRL APB Clock Mask             */
            uint32_t GCLK : 1;    /*!< bit:      3  GCLK APB Clock Mask                */
            uint32_t WDT : 1;     /*!< bit:      4  WDT APB Clock Mask                 */
            uint32_t RTC : 1;     /*!< bit:      5  RTC APB Clock Mask                 */
            uint32_t EIC : 1;     /*!< bit:      6  EIC APB Clock Mask                 */
            uint32_t : 25;        /*!< bit:  7..31  Reserved                           */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } PM_APBAMASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_APBAMASK_OFFSET         0x18          /**< \brief (PM_APBAMASK offset) APBA Mask */
#define PM_APBAMASK_RESETVALUE     0x0000007F    /**< \brief (PM_APBAMASK reset_value) APBA Mask */

#define PM_APBAMASK_PAC0_Pos       0             /**< \brief (PM_APBAMASK) PAC0 APB Clock Mask */
#define PM_APBAMASK_PAC0           ( 0x1u << PM_APBAMASK_PAC0_Pos )
#define PM_APBAMASK_PM_Pos         1             /**< \brief (PM_APBAMASK) PM APB Clock Mask */
#define PM_APBAMASK_PM             ( 0x1u << PM_APBAMASK_PM_Pos )
#define PM_APBAMASK_SYSCTRL_Pos    2             /**< \brief (PM_APBAMASK) SYSCTRL APB Clock Mask */
#define PM_APBAMASK_SYSCTRL        ( 0x1u << PM_APBAMASK_SYSCTRL_Pos )
#define PM_APBAMASK_GCLK_Pos       3             /**< \brief (PM_APBAMASK) GCLK APB Clock Mask */
#define PM_APBAMASK_GCLK           ( 0x1u << PM_APBAMASK_GCLK_Pos )
#define PM_APBAMASK_WDT_Pos        4             /**< \brief (PM_APBAMASK) WDT APB Clock Mask */
#define PM_APBAMASK_WDT            ( 0x1u << PM_APBAMASK_WDT_Pos )
#define PM_APBAMASK_RTC_Pos        5             /**< \brief (PM_APBAMASK) RTC APB Clock Mask */
#define PM_APBAMASK_RTC            ( 0x1u << PM_APBAMASK_RTC_Pos )
#define PM_APBAMASK_EIC_Pos        6             /**< \brief (PM_APBAMASK) EIC APB Clock Mask */
#define PM_APBAMASK_EIC            ( 0x1u << PM_APBAMASK_EIC_Pos )
#define PM_APBAMASK_MASK           0x0000007Fu   /**< \brief (PM_APBAMASK) MASK Register */

/* -------- PM_APBBMASK : (PM Offset: 0x1C) (R/W 32) APBB Mask -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t PAC1 : 1;    /*!< bit:      0  PAC1 APB Clock Mask                */
            uint32_t DSU : 1;     /*!< bit:      1  DSU APB Clock Mask                 */
            uint32_t NVMCTRL : 1; /*!< bit:      2  NVMCTRL APB Clock Mask             */
            uint32_t PORT : 1;    /*!< bit:      3  PORT APB Clock Mask                */
            uint32_t : 28;        /*!< bit:  4..31  Reserved                           */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } PM_APBBMASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_APBBMASK_OFFSET         0x1C          /**< \brief (PM_APBBMASK offset) APBB Mask */
#define PM_APBBMASK_RESETVALUE     0x0000001F    /**< \brief (PM_APBBMASK reset_value) APBB Mask */

#define PM_APBBMASK_PAC1_Pos       0             /**< \brief (PM_APBBMASK) PAC1 APB Clock Mask */
#define PM_APBBMASK_PAC1           ( 0x1u << PM_APBBMASK_PAC1_Pos )
#define PM_APBBMASK_DSU_Pos        1             /**< \brief (PM_APBBMASK) DSU APB Clock Mask */
#define PM_APBBMASK_DSU            ( 0x1u << PM_APBBMASK_DSU_Pos )
#define PM_APBBMASK_NVMCTRL_Pos    2             /**< \brief (PM_APBBMASK) NVMCTRL APB Clock Mask */
#define PM_APBBMASK_NVMCTRL        ( 0x1u << PM_APBBMASK_NVMCTRL_Pos )
#define PM_APBBMASK_PORT_Pos       3             /**< \brief (PM_APBBMASK) PORT APB Clock Mask */
#define PM_APBBMASK_PORT           ( 0x1u << PM_APBBMASK_PORT_Pos )
#define PM_APBBMASK_MASK           0x0000000Fu   /**< \brief (PM_APBBMASK) MASK Register */

/* -------- PM_APBCMASK : (PM Offset: 0x20) (R/W 32) APBC Mask -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t PAC2 : 1;    /*!< bit:      0  PAC2 APB Clock Mask                */
            uint32_t EVSYS : 1;   /*!< bit:      1  EVSYS APB Clock Mask               */
            uint32_t SERCOM0 : 1; /*!< bit:      2  SERCOM0 APB Clock Mask             */
            uint32_t SERCOM1 : 1; /*!< bit:      3  SERCOM1 APB Clock Mask             */
            uint32_t SERCOM2 : 1; /*!< bit:      4  SERCOM2 APB Clock Mask             */
            uint32_t SERCOM3 : 1; /*!< bit:      5  SERCOM3 APB Clock Mask             */
            uint32_t SERCOM4 : 1; /*!< bit:      6  SERCOM4 APB Clock Mask             */
            uint32_t SERCOM5 : 1; /*!< bit:      7  SERCOM5 APB Clock Mask             */
            uint32_t TC0 : 1;     /*!< bit:      8  TC0 APB Clock Mask                 */
            uint32_t TC1 : 1;     /*!< bit:      9  TC1 APB Clock Mask                 */
            uint32_t TC2 : 1;     /*!< bit:     10  TC2 APB Clock Mask                 */
            uint32_t TC3 : 1;     /*!< bit:     11  TC3 APB Clock Mask                 */
            uint32_t TC4 : 1;     /*!< bit:     12  TC4 APB Clock Mask                 */
            uint32_t TC5 : 1;     /*!< bit:     13  TC5 APB Clock Mask                 */
            uint32_t TC6 : 1;     /*!< bit:     14  TC6 APB Clock Mask                 */
            uint32_t TC7 : 1;     /*!< bit:     15  TC7 APB Clock Mask                 */
            uint32_t ADC : 1;     /*!< bit:     16  ADC APB Clock Mask                 */
            uint32_t AC : 1;      /*!< bit:     17  AC APB Clock Mask                  */
            uint32_t DAC : 1;     /*!< bit:     18  DAC APB Clock Mask                 */
            uint32_t : 13;        /*!< bit: 19..31  Reserved                           */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } PM_APBCMASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_APBCMASK_OFFSET         0x20          /**< \brief (PM_APBCMASK offset) APBC Mask */
#define PM_APBCMASK_RESETVALUE     0x00010000    /**< \brief (PM_APBCMASK reset_value) APBC Mask */

#define PM_APBCMASK_PAC2_Pos       0             /**< \brief (PM_APBCMASK) PAC2 APB Clock Mask */
#define PM_APBCMASK_PAC2           ( 0x1u << PM_APBCMASK_PAC2_Pos )
#define PM_APBCMASK_EVSYS_Pos      1             /**< \brief (PM_APBCMASK) EVSYS APB Clock Mask */
#define PM_APBCMASK_EVSYS          ( 0x1u << PM_APBCMASK_EVSYS_Pos )
#define PM_APBCMASK_SERCOM0_Pos    2             /**< \brief (PM_APBCMASK) SERCOM0 APB Clock Mask */
#define PM_APBCMASK_SERCOM0        ( 0x1u << PM_APBCMASK_SERCOM0_Pos )
#define PM_APBCMASK_SERCOM1_Pos    3             /**< \brief (PM_APBCMASK) SERCOM1 APB Clock Mask */
#define PM_APBCMASK_SERCOM1        ( 0x1u << PM_APBCMASK_SERCOM1_Pos )
#define PM_APBCMASK_SERCOM2_Pos    4             /**< \brief (PM_APBCMASK) SERCOM2 APB Clock Mask */
#define PM_APBCMASK_SERCOM2        ( 0x1u << PM_APBCMASK_SERCOM2_Pos )
#define PM_APBCMASK_SERCOM3_Pos    5             /**< \brief (PM_APBCMASK) SERCOM3 APB Clock Mask */
#define PM_APBCMASK_SERCOM3        ( 0x1u << PM_APBCMASK_SERCOM3_Pos )
#define PM_APBCMASK_SERCOM4_Pos    6             /**< \brief (PM_APBCMASK) SERCOM4 APB Clock Mask */
#define PM_APBCMASK_SERCOM4        ( 0x1u << PM_APBCMASK_SERCOM4_Pos )
#define PM_APBCMASK_SERCOM5_Pos    7             /**< \brief (PM_APBCMASK) SERCOM5 APB Clock Mask */
#define PM_APBCMASK_SERCOM5        ( 0x1u << PM_APBCMASK_SERCOM5_Pos )
#define PM_APBCMASK_TC0_Pos        8             /**< \brief (PM_APBCMASK) TC0 APB Clock Mask */
#define PM_APBCMASK_TC0            ( 0x1u << PM_APBCMASK_TC0_Pos )
#define PM_APBCMASK_TC1_Pos        9             /**< \brief (PM_APBCMASK) TC1 APB Clock Mask */
#define PM_APBCMASK_TC1            ( 0x1u << PM_APBCMASK_TC1_Pos )
#define PM_APBCMASK_TC2_Pos        10            /**< \brief (PM_APBCMASK) TC2 APB Clock Mask */
#define PM_APBCMASK_TC2            ( 0x1u << PM_APBCMASK_TC2_Pos )
#define PM_APBCMASK_TC3_Pos        11            /**< \brief (PM_APBCMASK) TC3 APB Clock Mask */
#define PM_APBCMASK_TC3            ( 0x1u << PM_APBCMASK_TC3_Pos )
#define PM_APBCMASK_TC4_Pos        12            /**< \brief (PM_APBCMASK) TC4 APB Clock Mask */
#define PM_APBCMASK_TC4            ( 0x1u << PM_APBCMASK_TC4_Pos )
#define PM_APBCMASK_TC5_Pos        13            /**< \brief (PM_APBCMASK) TC5 APB Clock Mask */
#define PM_APBCMASK_TC5            ( 0x1u << PM_APBCMASK_TC5_Pos )
#define PM_APBCMASK_TC6_Pos        14            /**< \brief (PM_APBCMASK) TC6 APB Clock Mask */
#define PM_APBCMASK_TC6            ( 0x1u << PM_APBCMASK_TC6_Pos )
#define PM_APBCMASK_TC7_Pos        15            /**< \brief (PM_APBCMASK) TC7 APB Clock Mask */
#define PM_APBCMASK_TC7            ( 0x1u << PM_APBCMASK_TC7_Pos )
#define PM_APBCMASK_ADC_Pos        16            /**< \brief (PM_APBCMASK) ADC APB Clock Mask */
#define PM_APBCMASK_ADC            ( 0x1u << PM_APBCMASK_ADC_Pos )
#define PM_APBCMASK_AC_Pos         17            /**< \brief (PM_APBCMASK) AC APB Clock Mask */
#define PM_APBCMASK_AC             ( 0x1u << PM_APBCMASK_AC_Pos )
#define PM_APBCMASK_DAC_Pos        18            /**< \brief (PM_APBCMASK) DAC APB Clock Mask */
#define PM_APBCMASK_DAC            ( 0x1u << PM_APBCMASK_DAC_Pos )
#define PM_APBCMASK_MASK           0x0007FFFFu   /**< \brief (PM_APBCMASK) MASK Register */

