FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_pm.h
/* -------- PM_INTENCLR : (PM Offset: 0x34) (R/W  8) Interrupt Enable Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t CKRDY : 1; /*!< bit:      0  Clock Ready Interrupt Enable Clear */
            uint8_t CFD : 1;   /*!< bit:      1  Clock Failure Detector Enable Clear */
            uint8_t  : 6;      /*!< bit:  2.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } PM_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_INTENCLR_OFFSET        0x34           /**< \brief (PM_INTENCLR offset) Interrupt Enable Clear Register */
#define PM_INTENCLR_RESETVALUE    0x00           /**< \brief (PM_INTENCLR reset_value) Interrupt Enable Clear Register */

#define PM_INTENCLR_CKRDY_Pos     0              /**< \brief (PM_INTENCLR) Clock Ready Interrupt Enable Clear */
#define PM_INTENCLR_CKRDY         ( 0x1u << PM_INTENCLR_CKRDY_Pos )
#define PM_INTENCLR_CFD_Pos       1              /**< \brief (PM_INTENCLR) Clock Failure Detector Enable Clear */
#define PM_INTENCLR_CFD           ( 0x1u << PM_INTENCLR_CFD_Pos )
#define PM_INTENCLR_MASK          0x03u          /**< \brief (PM_INTENCLR) MASK Register */

/* -------- PM_INTENSET : (PM Offset: 0x35) (R/W  8) Interrupt Enable Set Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t CKRDY : 1; /*!< bit:      0  Clock Ready Interrupt Enable Set   */
            uint8_t CFD : 1;   /*!< bit:      1  Clock Failure Detector Enable Set  */
            uint8_t  : 6;      /*!< bit:  2.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } PM_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_INTENSET_OFFSET        0x35           /**< \brief (PM_INTENSET offset) Interrupt Enable Set Register */
#define PM_INTENSET_RESETVALUE    0x00           /**< \brief (PM_INTENSET reset_value) Interrupt Enable Set Register */

#define PM_INTENSET_CKRDY_Pos     0              /**< \brief (PM_INTENSET) Clock Ready Interrupt Enable Set */
#define PM_INTENSET_CKRDY         ( 0x1u << PM_INTENSET_CKRDY_Pos )
#define PM_INTENSET_CFD_Pos       1              /**< \brief (PM_INTENSET) Clock Failure Detector Enable Set */
#define PM_INTENSET_CFD           ( 0x1u << PM_INTENSET_CFD_Pos )
#define PM_INTENSET_MASK          0x03u          /**< \brief (PM_INTENSET) MASK Register */

/* -------- PM_INTFLAG : (PM Offset: 0x36) (R/W  8) Interrupt Flag Status and Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t CKRDY : 1; /*!< bit:      0  Clock Ready Interrupt              */
            uint8_t CFD : 1;   /*!< bit:      1  Clock Failure Detectore Interrupt  */
            uint8_t  : 6;      /*!< bit:  2.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } PM_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_INTFLAG_OFFSET        0x36            /**< \brief (PM_INTFLAG offset) Interrupt Flag Status and Clear Register */
#define PM_INTFLAG_RESETVALUE    0x00            /**< \brief (PM_INTFLAG reset_value) Interrupt Flag Status and Clear Register */

#define PM_INTFLAG_CKRDY_Pos     0               /**< \brief (PM_INTFLAG) Clock Ready Interrupt */
#define PM_INTFLAG_CKRDY         ( 0x1u << PM_INTFLAG_CKRDY_Pos )
#define PM_INTFLAG_CFD_Pos       1               /**< \brief (PM_INTFLAG) Clock Failure Detectore Interrupt */
#define PM_INTFLAG_CFD           ( 0x1u << PM_INTFLAG_CFD_Pos )
#define PM_INTFLAG_MASK          0x03u           /**< \brief (PM_INTFLAG) MASK Register */

/* -------- PM_RCAUSE : (PM Offset: 0x38) (R/   8) Reset Cause Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t POR : 1;   /*!< bit:      0  Power-on Reset                     */
            uint8_t BOD12 : 1; /*!< bit:      1  Brown-out 1.2V Reset               */
            uint8_t BOD33 : 1; /*!< bit:      2  Brown-out 3.3V Reset               */
            uint8_t  : 1;      /*!< bit:      3  Reserved                           */
            uint8_t EXT : 1;   /*!< bit:      4  External Reset Pin                 */
            uint8_t WDT : 1;   /*!< bit:      5  Watchdog Reset                     */
            uint8_t SYST : 1;  /*!< bit:      6  System Reset Request               */
            uint8_t  : 1;      /*!< bit:      7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } PM_RCAUSE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_RCAUSE_OFFSET        0x38             /**< \brief (PM_RCAUSE offset) Reset Cause Register */
#define PM_RCAUSE_RESETVALUE    0x01             /**< \brief (PM_RCAUSE reset_value) Reset Cause Register */

#define PM_RCAUSE_POR_Pos       0                /**< \brief (PM_RCAUSE) Power-on Reset */
#define PM_RCAUSE_POR           ( 0x1u << PM_RCAUSE_POR_Pos )
#define PM_RCAUSE_BOD12_Pos     1                /**< \brief (PM_RCAUSE) Brown-out 1.2V Reset */
#define PM_RCAUSE_BOD12         ( 0x1u << PM_RCAUSE_BOD12_Pos )
#define PM_RCAUSE_BOD33_Pos     2                /**< \brief (PM_RCAUSE) Brown-out 3.3V Reset */
#define PM_RCAUSE_BOD33         ( 0x1u << PM_RCAUSE_BOD33_Pos )
#define PM_RCAUSE_EXT_Pos       4                /**< \brief (PM_RCAUSE) External Reset Pin */
#define PM_RCAUSE_EXT           ( 0x1u << PM_RCAUSE_EXT_Pos )
#define PM_RCAUSE_WDT_Pos       5                /**< \brief (PM_RCAUSE) Watchdog Reset */
#define PM_RCAUSE_WDT           ( 0x1u << PM_RCAUSE_WDT_Pos )
#define PM_RCAUSE_SYST_Pos      6                /**< \brief (PM_RCAUSE) System Reset Request */
#define PM_RCAUSE_SYST          ( 0x1u << PM_RCAUSE_SYST_Pos )
#define PM_RCAUSE_MASK          0x77u            /**< \brief (PM_RCAUSE) MASK Register */

/** \brief PM hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct
    {
        __IO PM_CTRL_Type CTRL;               /**< \brief Offset: 0x00 (R/W  8) Control Register */
        __IO PM_SLEEP_Type SLEEP;             /**< \brief Offset: 0x01 (R/W  8) Sleep Register */
        RoReg8 Reserved1[ 0x6 ];
        __IO PM_CPUSEL_Type CPUSEL;           /**< \brief Offset: 0x08 (R/W  8) CPU Clock Select */
        __IO PM_APBASEL_Type APBASEL;         /**< \brief Offset: 0x09 (R/W  8) APBA Clock Select */
        __IO PM_APBBSEL_Type APBBSEL;         /**< \brief Offset: 0x0A (R/W  8) APBB Clock Select */
        __IO PM_APBCSEL_Type APBCSEL;         /**< \brief Offset: 0x0B (R/W  8) APBC Clock Select */
        RoReg8 Reserved2[ 0x8 ];
        __IO PM_AHBMASK_Type AHBMASK;         /**< \brief Offset: 0x14 (R/W 32) AHB Mask */
        __IO PM_APBAMASK_Type APBAMASK;       /**< \brief Offset: 0x18 (R/W 32) APBA Mask */
        __IO PM_APBBMASK_Type APBBMASK;       /**< \brief Offset: 0x1C (R/W 32) APBB Mask */
        __IO PM_APBCMASK_Type APBCMASK;       /**< \brief Offset: 0x20 (R/W 32) APBC Mask */
        RoReg8 Reserved3[ 0x10 ];
        __IO PM_INTENCLR_Type INTENCLR;       /**< \brief Offset: 0x34 (R/W  8) Interrupt Enable Clear Register */
        __IO PM_INTENSET_Type INTENSET;       /**< \brief Offset: 0x35 (R/W  8) Interrupt Enable Set Register */
        __IO PM_INTFLAG_Type INTFLAG;         /**< \brief Offset: 0x36 (R/W  8) Interrupt Flag Status and Clear Register */
        RoReg8 Reserved4[ 0x1 ];
        __I PM_RCAUSE_Type RCAUSE;            /**< \brief Offset: 0x38 (R/   8) Reset Cause Register */
    } Pm;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAMD20_PM_COMPONENT_ */
